export default {
  工作站布局B:[
    {
      name: "工作站布局操作",
      type: "a",
      nums: [1],
      to: 1,
    },
    {
      name: "电气安装步骤及图纸",
      type: "a",
      nums: [2],
      to: 2,
    },
  ],
  示教器操作: [
    {
      name: "实训开始",
      type: "a",
      nums: [-2],
      to: -2,
    },
    {
      name: "请点击开始按钮进行实训",
      type: "c",
      num: -2,
    },
    {
      name: "示教器结构认知",
      type: "a",
      nums: [-1],
      to: -1,
    },
    {
      name: "示教器的结构说明",
      type: "c",
      num: -1,
    },
    {
      name: "示教器使能按钮操作",
      type: "a",
      nums: [0, 1, 2],
      to: 0,
    },
    {
      name: "使能按钮是为保证操作人员人身安全而设置的，只有在按下使能器按钮第一档，保证在“电机开启”的状态，才能对机器人进行手动操作与程序调试。发生危险时，人会本能的将使能器按钮松开或按紧到第二档，机器人会马上停止，保证安全。",
      type: "c",
      num: 0,
    },
    {
      name: "使能按钮是为保证操作人员人身安全而设置的，只有在按下使能器按钮第一档，保证在“电机开启”的状态，才能对机器人进行手动操作与程序调试。发生危险时，人会本能的将使能器按钮松开或按紧到第二档，机器人会马上停止，保证安全。",
      type: "c",
      num: 1,
    },
    {
      name: "使能按钮是为保证操作人员人身安全而设置的，只有在按下使能器按钮第一档，保证在“电机开启”的状态，才能对机器人进行手动操作与程序调试。发生危险时，人会本能的将使能器按钮松开或按紧到第二档，机器人会马上停止，保证安全。",
      type: "c",
      num: 2,
    },
    {
      name: "示教器功能键操作",
      type: "a",
      nums: [3, 4, 5,6],
      to: 3,
    },
    {
      name: "紧急停止按钮操作",
      type: "b",
      nums: [3, 4, 5],
    },
    {
      name: "按下示教器上的紧急停止按钮",
      type: "c",
      num: 3,
    },
    {
      name: "顺时针旋转（点击）恢复紧急停止按钮状态",
      type: "c",
      num: 4,
    },
    {
      name: "点击电机灯，恢复电机运行状态",
      type: "c",
      num: 5,
    },
        {
      name: "示教器功能键认知",
      type: "b",
      nums: [6],
    },
    {
      name: "示教器功能键认知",
      type: "c",
      num: 6,
    },
    // {
    //   name: "示教器动作模式快捷操作",
    //   type: "b",
    //   nums: [7, 9],
    // },
    // {
    //   name: "切换重定位/线性",
    //   type: "c",
    //   num: 7,
    // },
    // {
    //   name: "切换轴1-3/轴4-6",
    //   type: "c",
    //   num: 9,
    // },
    // {
    //   name: "示教器增量模式快捷操作",
    //   type: "b",
    //   nums: [11],
    // },
    // {
    //   name: "切换增量/无增量",
    //   type: "c",
    //   num: 11,
    // },
    // {
    //   name: "程序运行键操作",
    //   type: "b",
    //   nums: [13, 14, 15, 16, 17, 18, 19, 20],
    // },
    // {
    //   name: "点击程序编辑器",
    //   type: "c",
    //   num: 13,
    // },
    // {
    //   name: "点击调试",
    //   type: "c",
    //   num: 14,
    // },
    // {
    //   name: "选择“PP移至Main”移动光标",
    //   type: "c",
    //   num: 15,
    // },
    // {
    //   name: "点击启动",
    //   type: "c",
    //   num: 16,
    // },
    // {
    //   name: "点击停止",
    //   type: "c",
    //   num: 17,
    // },
    // {
    //   name: "点击下一步",
    //   type: "c",
    //   num: 18,
    // },
    // {
    //   name: "点击上一步",
    //   type: "c",
    //   num: 19,
    // },
    // {
    //   name: "点击弹窗确定",
    //   type: "c",
    //   num: 20,
    // },
    {
      name: "工业机器人控制模式切换",
      type: "a",
      nums: [21, 22, 23, 24,25],
      to: 21,
    },
    {
        name: "旋转（点击）钥匙将控制模式从“自动”切换为“手动”",
        type: "c",
        num: 21,
      },
      {
        name: "旋转（点击）钥匙将控制模式从“手动”切换为“自动”",
        type: "c",
        num: 22,
      },
      {
        name: "点击“确定”，确认操作模式的更改。",
        type: "c",
        num: 23,
      },
      {
        name: "点击电机灯，恢复电机开启状态。",
        type: "c",
        num: 24,
      },
      {
        name: "旋转（点击）钥匙将控制模式从“自动”切换为“手动”",
        type: "c",
        num: 25,
      },
    // {
    //   name: "开机操作",
    //   type: "b",
    //   nums: [21],
    // },
    // {
    //   name: "将电源拨至“on”，开启工业ABB机器人",
    //   type: "c",
    //   num: 21,
    // },
    // {
    //   name: "控制模式切换",
    //   type: "b",
    //   nums: [22, 23, 24],
    // },
    // {
    //   name: "将模式切换成“手动”模式，电机灯闪烁，示教器显示“手动",
    //   type: "c",
    //   num: 22,
    // },
    // {
    //   name: "将模式切换成“自动”模式，电机灯不亮，示教器显示“自动“电机关闭”",
    //   type: "c",
    //   num: 23,
    // },
    // {
    //   name: "点击电机灯，将灯常亮，示教器显示电机开启",
    //   type: "c",
    //   num: 24,
    // },
    // {
    //   name: "关机操作",
    //   type: "b",
    //   nums: [26, 27, 28, 29, 30],
    // },
    // {
    //   name: "点击“重新启动”",
    //   type: "c",
    //   num: 26,
    // },
    // {
    //   name: "点击“高级”",
    //   type: "c",
    //   num: 27,
    // },
    // {
    //   name: "勾选关闭计算机，点击“下一个”",
    //   type: "c",
    //   num: 28,
    // },
    // {
    //   name: "弹出提示界面，点击“关闭计算机”",
    //   type: "c",
    //   num: 29,
    // },
    // {
    //   name: "将电源开关拨至“off”",
    //   type: "c",
    //   num: 30,
    // },
    {
      name: "工业机器人运动操作",
      type: "a",
      nums: [31,31.5,32,32.5,33, 34.1,34.2,34.3,34.4,34.5,34.6,34.7,34.8],
      to: 31,
    },
    // {
    //   name: "确定控制模式",
    //   type: "b",
    //   nums: [31],
    // },
    // {
    //   name: "确认控制模式已经设为“手动”,并点击下一步",
    //   type: "c",
    //   num: 31,
    // },
    {
      name: "设置手动控制速度",
      type: "b",
      nums: [31,31.5,32,32.5],
    },
    {
      name: "点击示教器屏幕右下角速度设置快捷方式",
      type: "c",
      num: 31,
    },
    {
      name: "点击右下角调节速度图标",
      type: "c",
      num: 31.5,
    },
    {
      name: "点击25%，设定控制速度为25%",
      type: "c",
      num: 32,
    },
    {
      name: "现在控制速度已经调整为25%",
      type: "c",
      num: 32.5,
    },
    {
      name: "选择动作模式并手动控制",
      type: "b",
      nums: [33, 34.1,34.2,34.3,34.4,34.5,34.6,34.7,34.8,],
    },
    {
      name: "按下使能按钮。",
      type: "c",
      num: 33,
    },
    // {
    //   name: "现在可使用控制杆控制机器人运动",
    //   type: "c",
    //   num: 34,
    // },
    {
      name: "点击示教器屏幕左上角菜单按钮",
      type: "c",
      num: 34.1,
    },
    {
      name: "然后点击“手动操纵“项",
      type: "c",
      num: 34.3,
    },
    {
      name: "再点击“动作模式“右侧的选项可切换不同模式",
      type: "c",
      num: 34.4,
    },
    {
      name: "点击不同的操作选项可切换不同模式",
      type: "c",
      num: 34.5,
    },
    {
      name: "点击不同的操作选项可切换不同模式",
      type: "c",
      num: 34.6,
    },
    {
      name: "点击不同的操作选项可切换不同模式",
      type: "c",
      num: 34.7,
    },
    {
      name: "点击不同的操作选项可切换不同模式",
      type: "c",
      num: 34.8,
    },
    {
      name: "工业机器人坐标系选择",
      type: "a",
      nums: [35, 36, 37, 38],
      to: 35,
    },
    {
      name: "选择工具坐标【tool_grip】",
      type: "b",
      nums: [35, 36],
    },
    {
      name: "点击工具坐标",
      type: "c",
      num: 35,
    },
    {
      name: "进入工具坐标列表，选择对应工具名称",
      type: "c",
      num: 36,
    },
    {
      name: "选择工件坐标【wobj6】",
      type: "b",
      nums: [37, 38],
    },
    {
      name: "点击工件坐标",
      type: "c",
      num: 37,
    },
    {
      name: "进入工件坐标列表，选择对应工件名称",
      type: "c",
      num: 38,
    },
    {
      name: "程序编辑器和常用指令",
      type: "a",
      nums: [39,40,41,42,43,44,45,46,47,48,49,50,51,52],
      to: 39,
    },
    {
      name: "程序编辑器的使用",
      type: "b",
      nums: [39,40,41,42,43,44],
    },
    {
      name: "点击示教器屏幕左上角菜单按钮",
      type: "c",
      num: 39,
    },
    {
      name: "点击“程序编辑器“项进入程序编辑器",
      type: "c",
      num: 40,
    },
    {
      name: "程序编辑器用于编辑、调试和执行RAPID语言程序。RAPID语言是针对示教编程机器人编程语言，结构和风格类似于C语言。RAPID程序就是把一连串的RAPID指令认为有序的组织起来，形成应用程序，执行RAPID程序可以实现对机器人的操作控制。点击“添加指令“。",
      type: "c",
      num: 41,
    },
    {
      name: "使用“添加指令“功能可以快速的选择常用指令添加到程序中。点击“编辑“。",
      type: "c",
      num: 42,
    },
    {
      name: "“编辑“功能可以让用户比较方便的编辑已经写好的程序。点击“调试“。",
      type: "c",
      num: 43,
    },
    {
      name: "“调试“功能用于对程序进行运行调试。",
      type: "c",
      num: 44,
    },
    {
      name: "常用指令介绍",
      type: "b",
      nums: [45,46,47,48,49,50,51],
    },
    {
      name: "工业机器人示教编程中比较常用的指令。",
      type: "c",
      num: 45,
    },
    {
      name: "MoveAbsJ，绝对位置运动指令。",
      type: "c",
      num: 46,
    },
    {
      name: "MoveJ，关节运动指令。",
      type: "c",
      num: 47,
    },
    {
      name: "MoveL，线性运动指令。",
      type: "c",
      num: 48,
    },
    {
      name: "MoveC，圆弧运动指令。",
      type: "c",
      num: 49,
    },
    {
      name: "VelSet，速度设定指令。",
      type: "c",
      num: 50,
    },
    {
      name: "AccSet，加速度设定指令。",
      type: "c",
      num: 51,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [52],
      to: 52,
    },
  ],
  涂胶调试: [
    {
      name: "涂胶工具的拾取和释放",
      type: "a",
      nums: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
      to: 0,
    },
    {
      name: "规划涂胶工具的拾取与释放程序",
      type: "b",
      nums: [0],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 0,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [1, 2, 3, 4],
    },
    {
      name: "操纵机器人运动至取放胶枪工具程序的安全点，即Gt_Home点。",
      type: "c",
      num: 1,
    },
    {
      name: "选中“Gt_Home”，点击“编辑”，点击“修改位置”，完成Gt_Home点的记录。",
      type: "c",
      num: 2,
    },
    {
      name: "操纵机器人运动至取放胶枪工具点位，即Gt_Pos点。",
      type: "c",
      num: 3,
    },
    {
      name: "选中“Gt_Pos”，点击“编辑”，点击“修改位置”，完成Gt_Pos点的记录。",
      type: "c",
      num: 4,
    },
    {
      name: "编制机器人取胶枪工具程序",
      type: "b",
      nums: [5],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 5,
    },
    {
      name: "编制机器人放胶枪工具程序",
      type: "b",
      nums: [6],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 6,
    },
    {
      name: "取胶枪工具的调试运行",
      type: "b",
      nums: [7, 8],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 7,
    },
    {
      name: "选中“MGetGt”，点击“确定”",
      type: "c",
      num: 8,
    },

    {
      name: "放胶枪工具的调试运行",
      type: "b",
      nums: [9, 10],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 9,
    },
    {
      name: "选中“MPutGt”，点击“确定”",
      type: "c",
      num: 10,
    },
    {
      name: "规则轨迹的涂胶调试",
      type: "a",
      nums: [11],
      to: 11,
    },
    {
      name: "规划规则涂胶工艺运动路径，依次手动点击运动路径点位添加点位信息，并运行程序",
      type: "c",
      num: 11,
    },
    {
      name: "不规则轨迹的涂胶调试",
      type: "a",
      nums: [12],
      to: 12,
    },
    {
      name: "规划规则涂胶工艺运动路径，依次手动点击运动路径点位添加点位信息，并运行程序",
      type: "c",
      num: 12,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [13],
      to: 13,
    },
  ],
  码垛调试: [
    {
      name: "码垛工具的拾取和释放",
      type: "a",
      nums: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
      to: 0,
    },
    {
      name: "规划码垛工具的拾取与释放程序",
      type: "b",
      nums: [0],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 0,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [1, 2, 3, 4],
    },
    {
      name: "操纵机器人运动至取放码垛工具程序的安全点，即Gt_Home点。",
      type: "c",
      num: 1,
    },
    {
      name: "选中“Gt_Home”，点击“编辑”，点击“修改位置”，完成Gt_Home点的记录。",
      type: "c",
      num: 2,
    },
    {
      name: "操纵机器人运动至取放码垛工具点位，即Gt_Pos点。",
      type: "c",
      num: 3,
    },
    {
      name: "选中“Gt_Pos”，点击“编辑”，点击“修改位置”，完成Gt_Pos点的记录。",
      type: "c",
      num: 4,
    },
    {
      name: "编制机器人取码垛工具程序",
      type: "b",
      nums: [5],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 5,
    },
    {
      name: "编制机器人放码垛工具程序",
      type: "b",
      nums: [6],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 6,
    },
    {
      name: "取码垛工具的调试运行",
      type: "b",
      nums: [7, 8],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 7,
    },
    {
      name: "选中“MGetGt”，点击“确定”",
      type: "c",
      num: 8,
    },

    {
      name: "放码垛工具的调试运行",
      type: "b",
      nums: [9, 10],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 9,
    },
    {
      name: "选中“MPutGt”，点击“确定”",
      type: "c",
      num: 10,
    },
    {
      name: "在仓储单元中拾取码垛块",
      type: "a",
      nums: [11, 12],
      to: 11,
    },
    {
      name: "选择将要拾取的码垛，点击点位提示按钮记录点位信息",
      type: "c",
      num: 11,
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写,然后点击“调试”运行",
      type: "c",
      num: 12,
    },
    {
      name: "在自重力供料槽中拾取码垛块",
      type: "a",
      nums: [13, 14],
      to: 11,
    },
    {
      name: "选择将要拾取的码垛，点击点位提示按钮记录点位信息",
      type: "c",
      num: 13,
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写,然后点击“调试”运行",
      type: "c",
      num: 14,
    },
    {
      name: "三花型码垛摆放演示",
      type: "a",
      nums: [15],
      to: 15,
    },
    {
      name: "点击演示按钮，进行三花型码垛摆放教学",
      type: "c",
      num: 15,
    },

    {
      name: "回字型码垛摆放演示",
      type: "a",
      nums: [16],
      to: 16,
    },
    {
      name: "点击演示按钮，进行回字型码垛摆放教学",
      type: "c",
      num: 16,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [17],
      to: 17,
    },
  ],
  多工艺调试: [
    {
      name: "焊枪工具的拾取和释放",
      type: "a",
      nums: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
      to: 0,
    },
    {
      name: "规划焊枪工具的拾取与释放程序",
      type: "b",
      nums: [0],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 0,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [1, 2, 3, 4],
    },
    {
      name: "操纵机器人运动至取放焊枪工具程序的安全点，即Gt_Home点。",
      type: "c",
      num: 1,
    },
    {
      name: "选中“Gt_Home”，点击“编辑”，点击“修改位置”，完成Gt_Home点的记录。",
      type: "c",
      num: 2,
    },
    {
      name: "操纵机器人运动至取放焊枪工具点位，即Gt_Pos点。",
      type: "c",
      num: 3,
    },
    {
      name: "选中“Gt_Pos”，点击“编辑”，点击“修改位置”，完成Gt_Pos点的记录。",
      type: "c",
      num: 4,
    },
    {
      name: "编制机器人取焊枪工具程序",
      type: "b",
      nums: [5],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 5,
    },
    {
      name: "编制机器人放焊枪工具程序",
      type: "b",
      nums: [6],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 6,
    },
    {
      name: "取焊枪工具的调试运行",
      type: "b",
      nums: [7, 8],
    },
    {
      name: "点击“播放”，运行程序",
      type: "c",
      num: 7,
    },
    // {
    //   name: "选中“MGetGt”，点击“确定”",
    //   type: "c",
    //   num: 8,
    // },

    {
      name: "放焊枪工具的调试运行",
      type: "b",
      nums: [9, 10],
    },
    {
      name: "点击“播放”，运行程序",
      type: "c",
      num: 9,
    },
    // {
    //   name: "选中“MPutGt”，点击“确定”",
    //   type: "c",
    //   num: 10,
    // },
    //打磨抛光
    {
      name: "打磨抛光工具的拾取和释放",
      type: "a",
      nums: [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21],
      to: 11,
    },
    {
      name: "规划打磨抛光工具的拾取与释放程序",
      type: "b",
      nums: [11],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 11,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [12, 13, 14, 15],
    },
    {
      name: "操纵机器人运动至取放打磨抛光工具程序的安全点，即Pt_Home点。",
      type: "c",
      num: 12,
    },
    {
      name: "选中“Gt_Home”，点击“编辑”，点击“修改位置”，完成Pt_Home点的记录。",
      type: "c",
      num: 13,
    },
    {
      name: "操纵机器人运动至取放打磨抛光工具点位，即Pt_Pos点。",
      type: "c",
      num: 14,
    },
    {
      name: "选中“Gt_Pos”，点击“编辑”，点击“修改位置”，完成Pt_Pos点的记录。",
      type: "c",
      num: 15,
    },
    {
      name: "编制机器人取打磨抛光工具程序",
      type: "b",
      nums: [16],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 16,
    },
    {
      name: "编制机器人放打磨抛光工具程序",
      type: "b",
      nums: [17],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 17,
    },
    {
      name: "取打磨抛光工具的调试运行",
      type: "b",
      nums: [18, 19],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 18,
    },
    {
      name: "选中“MGetGt”，点击“确定”",
      type: "c",
      num: 19,
    },

    {
      name: "放打磨抛光工具的调试运行",
      type: "b",
      nums: [20, 21],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 20,
    },
    {
      name: "选中“MPutGt”，点击“确定”",
      type: "c",
      num: 21,
    },
    //变位机
    {
      name: "变位机夹紧和释放",
      type: "a",
      nums: [22, 23, 24, 25, 26, 27, 28, 29, 30],
      to: 22,
    },
    {
      name: "规划变位机夹紧和释放程序",
      type: "b",
      nums: [22],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 22,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [23, 24, 25, 26, 27],
    },
    {
      name: "操纵机器人运动至变位机夹紧和释放程序的安全点，即Wp_Home点。",
      type: "c",
      num: 23,
    },
    {
      name: "选中“Wp_Home”，点击“编辑”，点击“修改位置”，完成wp_Home点的记录。",
      type: "c",
      num: 24,
    },
    {
      name: "操纵机器人运动至工作点位，即Wp_Pos点。",
      type: "c",
      num: 25,
    },
    {
      name: "通过触摸屏测试变位机的运动控制",
      type: "c",
      num: 26,
    },
    {
      name: "选中“Wp_Pos”，点击“编辑”，点击“修改位置”，完成Wp_Pos点的记录。",
      type: "c",
      num: 27,
    },
    {
      name: "编制变位机夹紧和释放程序",
      type: "b",
      nums: [28],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 28,
    },
    {
      name: "变位机夹紧和释放的调试运行",
      type: "b",
      nums: [29, 30],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 29,
    },
    {
      name: "选中“MPutWt”，点击“确定”",
      type: "c",
      num: 30,
    },
    //焊接轨迹
    {
      name: "焊接轨迹调试",
      type: "a",
      nums: [31, 32, 33, 34, 35, 36],
      to: 31,
    },
    {
      name: "规划变位机控制弧焊程序",
      type: "b",
      nums: [31],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 31,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [32, 33],
    },
    {
      name: "操纵机器人运动至变位机控制弧焊点位。",
      type: "c",
      num: 32,
    },
    {
      name: "选中【Wt_Home】，点击【编辑】，点击【修改位置】，完成Wt_Home点的记录",
      type: "c",
      num: 33,
    },
    {
      name: "编制变位机控制弧焊程序",
      type: "b",
      nums: [34],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 34,
    },
    {
      name: "变位机控制弧焊程序调试运行",
      type: "b",
      nums: [35, 36],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 35,
    },
    {
      name: "选中“MWtask”，点击“确定”",
      type: "c",
      num: 36,
    },
    //打磨抛光轨迹
    {
      name: "打磨抛光轨迹调试",
      type: "a",
      nums: [37, 38, 39, 40, 41, 42],
      to: 37,
    },
    {
      name: "规划打磨抛光工艺程序",
      type: "b",
      nums: [37],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 37,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [38, 39],
    },
    {
      name: "操纵机器人运动至工作原点。",
      type: "c",
      num: 38,
    },
    {
      name: "选中【PtPolish_Home】，点击【编辑】，弹出对话框后，点击【修改】。",
      type: "c",
      num: 39,
    },
    {
      name: "编写打磨抛光工艺程序",
      type: "b",
      nums: [40],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 40,
    },
    {
      name: "打磨抛光轨迹的调试运行",
      type: "b",
      nums: [41, 42],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 41,
    },
    {
      name: "选中“MPtPolish”，点击“确定”",
      type: "c",
      num: 42,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [43],
      to: 43,
    },
  ],
  装配调试: [
    {
      name: "吸盘工具的拾取和释放",
      type: "a",
      nums: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
      to: 0,
    },
    {
      name: "规划吸盘工具的拾取与释放程序",
      type: "b",
      nums: [0],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 0,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [1, 2, 3, 4],
    },
    {
      name: "操纵机器人运动至取放吸盘工具程序的安全点，即Vt_Home点。",
      type: "c",
      num: 1,
    },
    {
      name: "选中“Vt_Home”，点击“编辑”，点击“修改位置”，完成Vt_Home点的记录。",
      type: "c",
      num: 2,
    },
    {
      name: "操纵机器人运动至取放吸盘工具点位，即Vt_Pos点。",
      type: "c",
      num: 3,
    },
    {
      name: "选中“Vt_Pos”，点击“编辑”，点击“修改位置”，完成Vt_Pos点的记录。",
      type: "c",
      num: 4,
    },
    {
      name: "编制机器人取吸盘工具程序",
      type: "b",
      nums: [5],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 5,
    },
    {
      name: "编制机器人放吸盘工具程序",
      type: "b",
      nums: [6],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 6,
    },
    {
      name: "取吸盘工具的调试运行",
      type: "b",
      nums: [7, 8],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 7,
    },
    {
      name: "选中“MGetVt”，点击“确定”",
      type: "c",
      num: 8,
    },
    {
      name: "放吸盘工具的调试运行",
      type: "b",
      nums: [9, 10],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 9,
    },
    {
      name: "选中“MPutVt”，点击“确定”",
      type: "c",
      num: 10,
    },
    //PCB盖板
    {
      name: "PCB盖板的拾取和释放",
      type: "a",
      nums: [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
      to: 0,
    },
    {
      name: "规划PCB盖板的拾取与释放运动路径",
      type: "b",
      nums: [11],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 11,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [12, 13, 14, 15, 16, 17],
    },
    {
      name: "操纵机器人运动至取PCB盖板程序的安全点，即MC_Home点。",
      type: "c",
      num: 12,
    },
    {
      name: "选中“Gt_Home”，点击“编辑”，点击“修改位置”，完成Pt_Home点的记录。",
      type: "c",
      num: 13,
    },
    {
      name: "操纵机器人运动至取PCB盖板工具点位，即Gc_Pos点。",
      type: "c",
      num: 14,
    },
    {
      name: "选中“Gc_Pos”，点击“编辑”，点击“修改位置”，完成Gc_Pos点的记录。",
      type: "c",
      num: 15,
    },
    {
      name: "操纵机器人运动至取PCB盖板工具点位，即Pc_Pos点。",
      type: "c",
      num: 16,
    },
    {
      name: "选中“Pc_Pos”，点击“编辑”，点击“修改位置”，完成Pc_Pos点的记录。",
      type: "c",
      num: 17,
    },
    {
      name: "编制机器人取PCB盖板程序",
      type: "b",
      nums: [18],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 18,
    },
    {
      name: "编制机器人放PCB盖板程序",
      type: "b",
      nums: [19],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 19,
    },
    {
      name: "取PCB盖板的调试运行",
      type: "b",
      nums: [20, 21],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 20,
    },
    {
      name: "选中“MGetMc”，点击“确定”",
      type: "c",
      num: 21,
    },

    {
      name: "放PCB盖板的调试运行",
      type: "b",
      nums: [22, 23],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 22,
    },
    {
      name: "选中“MPutMc”，点击“确定”",
      type: "c",
      num: 23,
    },

    //PCB芯片
    {
      name: "PCB芯片的拾取和释放",
      type: "a",
      nums: [24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37],
      to: 24,
    },
    {
      name: "规划PCB芯片的拾取与释放运动路径",
      type: "b",
      nums: [24],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 24,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [25, 26, 27, 28, 29, 30, 31, 32],
    },
    {
      name: "操纵机器人运动至取PCB芯片程序的安全点，即MA_Home点。",
      type: "c",
      num: 25,
    },
    {
      name: "选中“MA_Home”，点击“编辑”，点击“修改位置”，完成MA_Home点的记录。",
      type: "c",
      num: 26,
    },
    {
      name: "操纵机器人运动至取PCB芯片点位，即GCPU_Pos点。",
      type: "c",
      num: 27,
    },
    {
      name: "选中“GCPU_Pos”，点击“编辑”，点击“修改位置”，完成GCPU_Pos点的记录。",
      type: "c",
      num: 28,
    },
    {
      name: "操纵机器人运动至视觉检测PCB芯片点位，即VIC_Pos点。",
      type: "c",
      num: 29,
    },
    {
      name: "选中“VIC_Pos”，点击“编辑”，点击“修改位置”，完成VIC_Pos点的记录。",
      type: "c",
      num: 30,
    },
    {
      name: "操纵机器人运动至放PCB芯片点位，即PCPU_Pos点。",
      type: "c",
      num: 31,
    },
    {
      name: "选中“PCPU_Pos”，点击“编辑”，点击“修改位置”，完成PCPU_Pos点的记录。",
      type: "c",
      num: 32,
    },
    {
      name: "编制机器人取PCB芯片程序",
      type: "b",
      nums: [33],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 33,
    },
    {
      name: "编制机器人放PCB芯片程序",
      type: "b",
      nums: [34],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 34,
    },
    {
      name: "编制机器人PCB芯片的检测、拾取和放置程序",
      type: "b",
      nums: [35],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 35,
    },
    {
      name: "PCB芯片的检测、拾取和放置程序的调试运行",
      type: "b",
      nums: [36, 37],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 36,
    },
    {
      name: "选中“MGetMc”，点击“确定”",
      type: "c",
      num: 37,
    },
    //检测单元检测
    {
      name: "检测单元检测",
      type: "a",
      nums: [38],
      to: 38,
    },
    {
      name: "调试右侧芯片伸缩气缸",
      type: "c",
      num: 38,
    },
    {
      name: "调试右侧芯片升降气缸",
      type: "c",
      num: 38,
    },
    {
      name: "检测单元检测运行",
      type: "c",
      num: 38,
    },
    //PCB成品的拾取和释放
    {
      name: "PCB成品的拾取和释放",
      type: "a",
      nums: [39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51],
      to: 39,
    },
    {
      name: "规划PCB成品的拾取与释放程序",
      type: "b",
      nums: [39],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 39,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [40, 41, 42, 43, 44, 45],
    },
    {
      name: "操纵机器人运动至取放PCB成品程序的安全点，即MC_Home点。",
      type: "c",
      num: 40,
    },
    {
      name: "选中“Vt_Home”，点击“编辑”，点击“修改位置”，完成Vt_Home点的记录。",
      type: "c",
      num: 41,
    },
    {
      name: "操纵机器人运动至取PCB成品位置点点位，即Gc_Pos点。",
      type: "c",
      num: 42,
    },
    {
      name: "选中“Gc_Pos”，点击“编辑”，点击“修改位置”，完成Gc_Pos点的记录。",
      type: "c",
      num: 43,
    },
    {
      name: "操纵机器人运动至放PCB成品位置点点位，即Pc_Pos点。",
      type: "c",
      num: 44,
    },
    {
      name: "选中“Pc_Pos”，点击“编辑”，点击“修改位置”，完成Pc_Pos点的记录。",
      type: "c",
      num: 45,
    },
    {
      name: "编制机器人取成品程序",
      type: "b",
      nums: [46],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 46,
    },
    {
      name: "编制机器人放成品程序",
      type: "b",
      nums: [47],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 47,
    },
    {
      name: "取成品的调试运行",
      type: "b",
      nums: [48, 49],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 48,
    },
    {
      name: "选中“MGetMc”，点击“确定”",
      type: "c",
      num: 49,
    },
    {
      name: "放成品的调试运行",
      type: "b",
      nums: [50, 51],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 50,
    },
    {
      name: "选中“MPutMc”，点击“确定”",
      type: "c",
      num: 51,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [52],
      to: 52,
    },
  ],
  HMI模拟B: [
    // {
    //   name: "切换机器人控制模式",
    //   type: "a",
    //   nums: [1],
    //   to: 1,
    // },
    // {
    //   name: "将模式切换成自动模式，并点击电机灯切换成常亮",
    //   type: "c",
    //   num: 1,
    // },
    {
      name: "启动涂胶任务演示",
      type: "a",
      nums: [2],
      to: 2,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 2,
    },
    {
      name: "启动码垛任务演示",
      type: "a",
      nums: [3],
      to: 3,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 3,
    },
    {
      name: "启动多工艺任务演示",
      type: "a",
      nums: [4],
      to: 4,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 4,
    },
    {
      name: "启动装配任务演示",
      type: "a",
      nums: [5],
      to: 5,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 5,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [6],
      to: 6,
    },
    
  ],
  // 集成
  工作站布局A:[
    {
      name: "工作站布局操作",
      type: "a",
      nums: [1],
      to: 1,
    },
    {
      name: "电气安装步骤及图纸",
      type: "a",
      nums: [2],
      to: 2,
    },
  ],
  执行单元调试: [
    {
      name: "线性导轨运行调试",
      type: "a",
      nums: [1],
      to: 1,
    },
    {
      name: "在触摸屏中调试线性导轨",
      type: "c",
      num: 1,
    },
    //打磨抛光
    {
      name: "打磨抛光工具的拾取和释放",
      type: "a",
      nums: [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
      to: 2,
    },
    {
      name: "查看任务程序规划",
      type: "b",
      nums: [2],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 2,
    },
    {
      name: "示教点位的选取",
      type: "b",
      nums: [3, 4, 5, 6],
    },
    {
      name: "操纵机器人运动至取放打磨抛光工具程序的安全点，即Mt_Home点。",
      type: "c",
      num: 3,
    },
    {
      name: "选中“Mt_Home”，点击“编辑”，点击“修改位置”，完成Mt_Home点的记录。",
      type: "c",
      num: 4,
    },
    {
      name: "操纵机器人运动至取放打磨抛光工具点位，即Mt_Pos点。",
      type: "c",
      num: 5,
    },
    {
      name: "选中“Gt_Pos”，点击“编辑”，点击“修改位置”，完成Mt_Pos点的记录。",
      type: "c",
      num: 6,
    },
    {
      name: "编制机器人取打磨抛光工具程序",
      type: "b",
      nums: [7],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 7,
    },
    {
      name: "编制机器人放打磨抛光工具程序",
      type: "b",
      nums: [8],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 8,
    },
    {
      name: "取打磨抛光工具的调试运行",
      type: "b",
      nums: [9,9.1,9.2,9.3, 10],
    },
    {
      name: "在示教器界面点击“调试”",
      type: "c",
      num: 9,
    },
    {
      name: "在示教器界面选中“PP移至例行程序…”",
      type: "c",
      num: 9.1,
    },
    {
      name: "选中“MGetMt”，点击“确定”",
      type: "c",
      num: 9.2,
    },
    {
      name: "点击示教器右侧“播放”按钮执行程序",
      type: "c",
      num: 9.3,
    },
    {
      name: "选中“MGetMt”，点击“确定”",
      type: "c",
      num: 10,
    },

    {
      name: "放打磨抛光工具的调试运行",
      type: "b",
      nums: [11,11.1,11.2,11.3, 12],
    },
    {
      name: "在示教器界面点击“调试”",
      type: "c",
      num: 11,
    },
    {
      name: "在示教器界面选中“PP移至例行程序…”",
      type: "c",
      num: 11.1,
    },
    {
      name: "选中“MPutMt”，点击“确定”",
      type: "c",
      num: 11.2,
    },
    {
      name: "点击示教器右侧“播放”按钮执行程序",
      type: "c",
      num: 11.3,
    },
    {
      name: "选中“MPutMt”，点击“确定”",
      type: "c",
      num: 12,
    },
    //夹爪
    {
      name: "夹爪工具的拾取和释放",
      type: "a",
      nums: [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
      to: 13,
    },
    {
      name: "查看任务程序规划",
      type: "b",
      nums: [13],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 13,
    },
    {
      name: "示教点位的选取",
      type: "b",
      nums: [14, 15, 16, 17],
    },
    {
      name: "操纵机器人运动至取放夹爪工具程序的安全点，即Ct_Home点。",
      type: "c",
      num: 14,
    },
    {
      name: "选中“Ct_Home”，点击“编辑”，点击“修改位置”，完成Ct_Home点的记录。",
      type: "c",
      num: 15,
    },
    {
      name: "操纵机器人运动至取放夹爪工具点位，即Ct_Pos点。",
      type: "c",
      num: 16,
    },
    {
      name: "选中“Gt_Pos”，点击“编辑”，点击“修改位置”，完成Ct_Pos点的记录。",
      type: "c",
      num: 17,
    },
    {
      name: "编制机器人取夹爪工具程序",
      type: "b",
      nums: [18],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 18,
    },
    {
      name: "编制机器人放夹爪工具程序",
      type: "b",
      nums: [19],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 19,
    },
    {
      name: "取夹爪工具的调试运行",
      type: "b",
      nums: [20, 21],
    },
    {
      name: "点击示教器右侧“播放”按钮执行程序",
      type: "c",
      num: 20,
    },
    {
      name: "选中“MGetCt”，点击“确定”",
      type: "c",
      num: 21,
    },

    {
      name: "放夹爪工具的调试运行",
      type: "b",
      nums: [22, 23],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 22,
    },
    {
      name: "点击示教器右侧“播放”按钮执行程序",
      type: "c",
      num: 23,
    },
    //吸盘
    {
      name: "吸盘工具的拾取和释放",
      type: "a",
      nums: [24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34],
      to: 24,
    },
    {
      name: "查看任务程序规划",
      type: "b",
      nums: [24],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 24,
    },
    {
      name: "示教点位的选取",
      type: "b",
      nums: [25, 26, 27, 28],
    },
    {
      name: "操纵机器人运动至取放吸盘工具程序的安全点，即St_Home点。",
      type: "c",
      num: 25,
    },
    {
      name: "选中“St_Home”，点击“编辑”，点击“修改位置”，完成St_Home点的记录。",
      type: "c",
      num: 26,
    },
    {
      name: "操纵机器人运动至取放吸盘工具点位，即St_Pos点。",
      type: "c",
      num: 27,
    },
    {
      name: "选中“St_Pos”，点击“编辑”，点击“修改位置”，完成St_Pos点的记录。",
      type: "c",
      num: 28,
    },
    {
      name: "编制机器人取吸盘工具程序",
      type: "b",
      nums: [29],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 29,
    },
    {
      name: "编制机器人放吸盘工具程序",
      type: "b",
      nums: [30],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 30,
    },
    {
      name: "取吸盘工具的调试运行",
      type: "b",
      nums: [31, 32],
    },
    {
      name: "点击示教器右侧“播放”按钮执行程序",
      type: "c",
      num: 31,
    },
    {
      name: "选中“MGetSt”，点击“确定”",
      type: "c",
      num: 32,
    },

    {
      name: "放吸盘工具的调试运行",
      type: "b",
      nums: [33, 34],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 33,
    },
    {
      name: "点击示教器右侧“播放”按钮执行程序",
      type: "c",
      num: 34,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [35],
    },
  ],
  仓库单元调试: [
    {
      name: "仓储伸出与回缩及物料检测的运行调试",
      type: "a",
      nums: [1],
      to: 1,
    },
    {
      name: "在触摸屏中调试仓储伸出与回缩及物料检测",
      type: "c",
      num: 1,
    },
    //取放料
    {
      name: "机器人仓库取放料",
      type: "a",
      nums: [2],
      to: 2,
    },
    {
      name: "查看任务程序规划",
      type: "b",
      nums: [2],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 2,
    },
    {
      name: "示教点位的选取",
      type: "b",
      nums: [3, 4, 5, 6],
    },
    {
      name: "操纵机器人运动至取料程序的安全点，即SRt_Home点。",
      type: "c",
      num: 3,
    },
    {
      name: "选中“SRt_Home”，点击“编辑”，点击“修改位置”，完成SRt_Home点的记录。",
      type: "c",
      num: 4,
    },
    {
      name: "操纵机器人运动至放料点位，即SRt_Pos点。",
      type: "c",
      num: 5,
    },
    {
      name: "选中“SRt_Pos”，点击“编辑”，点击“修改位置”，完成SRt_Pos点的记录。",
      type: "c",
      num: 6,
    },
    {
      name: "编制机器人取料程序",
      type: "b",
      nums: [7],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 7,
    },
    {
      name: "编制机器人放料程序",
      type: "b",
      nums: [8],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 8,
    },
    {
      name: "取料程序的调试运行",
      type: "b",
      nums: [9, 10],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 9,
    },
    {
      name: "选中“MGetSRt”，点击“确定”",
      type: "c",
      num: 10,
    },

    {
      name: "放料程序的调试运行",
      type: "b",
      nums: [11, 12],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 11,
    },
    {
      name: "选中“MPutSRt”，点击“确定”",
      type: "c",
      num: 12,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [13],
      to: 13,
    },
  ],
  打磨单元调试: [
    {
      name: "打磨工位夹紧、翻转动作调试",
      type: "a",
      nums: [1],
      to: 1,
    },
    {
      name: "在触摸屏中进行工位夹紧、翻转动作的调试",
      type: "c",
      num: 1,
    },
    //上下料
    {
      name: "机器人打磨工位上下料",
      type: "a",
      nums: [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
      to: 2,
    },
    {
      name: "查看任务程序规划",
      type: "b",
      nums: [2],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 2,
    },
    {
      name: "示教点位的选取",
      type: "b",
      nums: [3, 4, 5, 6],
    },
    {
      name: "操纵机器人运动至打磨工位上下料程序的安全点，即Gt_Home点。",
      type: "c",
      num: 3,
    },
    {
      name: "选中“Gt_Home”，点击“编辑”，点击“修改位置”，完成Gt_Home点的记录。",
      type: "c",
      num: 4,
    },
    {
      name: "操纵机器人运动至打磨工位上下料点位，即Gt_Pos点。",
      type: "c",
      num: 5,
    },
    {
      name: "选中“SRt_Pos”，点击“编辑”，点击“修改位置”，完成Gt_Pos点的记录。",
      type: "c",
      num: 6,
    },
    {
      name: "编制机器人打磨工位上料程序",
      type: "b",
      nums: [7],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 7,
    },
    {
      name: "编制机器人打磨工位下料程序",
      type: "b",
      nums: [8],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 8,
    },
    {
      name: "打磨工位上料程序的调试运行",
      type: "b",
      nums: [9, 10],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 9,
    },
    {
      name: "选中“GWGetHub”，点击“确定”",
      type: "c",
      num: 10,
    },

    {
      name: "打磨工位下料程序的调试运行",
      type: "b",
      nums: [11, 12],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 11,
    },
    {
      name: "选中“GWPutHub”，点击“确定”",
      type: "c",
      num: 12,
    },
    //吹屑
    {
      name: "机器人吹屑工位模拟",
      type: "a",
      nums: [13, 14, 15, 16, 17, 18],
      to: 13,
    },
    {
      name: "查看任务程序规划",
      type: "b",
      nums: [13],
    },
    {
      name: "查看表格中相关信息名称,用来后续程序的调用。",
      type: "c",
      num: 13,
    },
    {
      name: "示教点位的选取",
      type: "b",
      nums: [14, 15],
    },
    {
      name: "操纵机器人运动至“吹屑工位中轮毂位置”,即“BC_Pos”点。",
      type: "c",
      num: 14,
    },
    {
      name: "选中“BC_Pos”,点击“编辑”，点击“修改位置”,完成BC_Pos点的记录。",
      type: "c",
      num: 15,
    },

    {
      name: "编制机器人吹屑程序",
      type: "b",
      nums: [16],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 16,
    },

    {
      name: "吹屑程序的调试运行",
      type: "b",
      nums: [17, 18],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 17,
    },
    {
      name: "选中“BCPutHub”，点击“确定”",
      type: "c",
      num: 18,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [19],
      to: 19,
    },
  ],
  压装单元调试: [
    {
      name: "压装气缸动作调试",
      type: "a",
      nums: [1],
      to: 1,
    },
    {
      name: "在触摸屏中进行压装气缸动作调试",
      type: "c",
      num: 1,
    },
    {
      name: "压装直线机构动作调试",
      type: "a",
      nums: [2],
      to: 2,
    },
    {
      name: "在触摸屏中进行压装直线机构动作调试",
      type: "c",
      num: 2,
    },
    //车标
    {
      name: "机器人车标压装调试",
      type: "a",
      nums: [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
      to: 3,
    },
    {
      name: "规划机器人车标压装程序",
      type: "b",
      nums: [3],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 3,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [4, 5, 6, 7],
    },
    {
      name: "操纵机器人运动至“车标拾取”点位，即LGet_pos点。",
      type: "c",
      num: 4,
    },
    {
      name: "选中“LGet_pos”，点击“编辑”，点击“修改位置”，完成LGet_pos点的记录。",
      type: "c",
      num: 5,
    },
    {
      name: "操纵机器人运动至“车标放置”点位，即LPut_pos点。",
      type: "c",
      num: 6,
    },
    {
      name: "选中“LPut_pos”，点击“编辑”，点击“修改位置”，完成LPut_pos点的记录。",
      type: "c",
      num: 7,
    },
    {
      name: "编写机器人拾取车标程序",
      type: "b",
      nums: [8],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 8,
    },
    {
      name: "编写机器人放置车标并压装的程序",
      type: "b",
      nums: [9],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 9,
    },
    {
      name: "机器人拾取车标调试运行",
      type: "b",
      nums: [10, 11],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 10,
    },
    {
      name: "选中“MLGet”，点击“确定”",
      type: "c",
      num: 11,
    },

    {
      name: "机器人放置车标并压装的调试运行",
      type: "b",
      nums: [12, 13],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 12,
    },
    {
      name: "选中“MLPut”，点击“确定”",
      type: "c",
      num: 13,
    },
    //外轮胎压装
    // {
    //   name: "外轮胎压装调试",
    //   type: "a",
    //   nums: [14, 15, 16, 17],
    //   to: 14,
    // },
    // {
    //   name: "规划外轮胎压装调试",
    //   type: "b",
    //   nums: [14],
    // },
    // {
    //   name: "查看表格中相关信息名称,用来后续程序的调用。",
    //   type: "c",
    //   num: 14,
    // },
    // {
    //   name: "编制外轮胎压装程序",
    //   type: "b",
    //   nums: [15],
    // },
    // {
    //   name: "在下列程序中，选择合适的指令和点位完成程序的编写",
    //   type: "c",
    //   num: 15,
    // },
    // {
    //   name: "外轮胎压装调试运行",
    //   type: "b",
    //   nums: [16, 17],
    // },
    // {
    //   name: "点击“调试”，选中“PP移至例行程序…”",
    //   type: "c",
    //   num: 16,
    // },
    // {
    //   name: "选中“MTirep”，点击“确定”",
    //   type: "c",
    //   num: 17,
    // },
    {
      name: "实训结束",
      type: "a",
      nums: [14],
      to: 14,
    },
  ],
  数控单元调试: [
    {
      name: "安全门开关调试",
      type: "a",
      nums: [1],
      to: 1,
    },
    {
      name: "在触摸屏中进行安全门开关调试",
      type: "c",
      num: 1,
    },
    {
      name: "工装夹紧与释放调试",
      type: "a",
      nums: [2],
      to: 2,
    },
    {
      name: "在触摸屏中进行工装夹紧与释放调试",
      type: "c",
      num: 2,
    },
    //机器人上下料调试
    {
      name: "机器人上下料调试",
      type: "a",
      nums: [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
      to: 3,
    },
    {
      name: "规划机器人上下料程序",
      type: "b",
      nums: [3],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 3,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [4, 5, 6, 7],
    },
    {
      name: "操纵机器人运动至“工作原点”点位，即CRt_Home点。",
      type: "c",
      num: 4,
    },
    {
      name: "选中“CRt_Home”，点击“编辑”，点击“修改位置”，完成CRt_Home点的记录。",
      type: "c",
      num: 5,
    },
    {
      name: "操纵机器人运动至“轮毂放置”点位，即CRt_Pos点。",
      type: "c",
      num: 6,
    },
    {
      name: "选中“CRt_Pos”，点击“编辑”，点击“修改位置”，完成CRt_Pos点的记录。",
      type: "c",
      num: 7,
    },
    {
      name: "编写机器人上料程序",
      type: "b",
      nums: [8],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 8,
    },
    {
      name: "编写机器人下料程序",
      type: "b",
      nums: [9],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 9,
    },
    {
      name: "机器人上料程序调试运行",
      type: "b",
      nums: [10, 11],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 10,
    },
    {
      name: "选中“MGetHub”，点击“确定”",
      type: "c",
      num: 11,
    },

    {
      name: "机器人下料程序调试运行",
      type: "b",
      nums: [12, 13],
    },
    {
      name: "点击“调试”，选中“PP移至例行程序…”",
      type: "c",
      num: 12,
    },
    {
      name: "选中“MPutHub”，点击“确定”",
      type: "c",
      num: 13,
    },
    {
      name: "数控模拟加工",
      type: "a",
      nums: [14],
      to: 14,
    },
    {
      name: "在数控操作面板中进行数控模拟加工",
      type: "c",
      num: 14,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [15],
      to: 15,
    },
  ],
  SCARA机器人: [
    // scara1
    {
      name: "轮毂拾取",
      type: "a",
      nums: [1, 2, 3, 4, 5],
      to: 1,
    },
    {
      name: "规划轮毂拾取的运动路径",
      type: "b",
      nums: [1],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 1,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [2, 3],
    },
    {
      name: "用户坐标系选中“全局坐标系：0”，工具坐标系选中“全局坐标系：0”，然后点击“OK”进行确认。",
      type: "c",
      num: 2,
    },
    {
      name: "依次点击“工作原点”、“轮毂点位”进行示教点位信息记录",
      type: "c",
      num: 3,
    },
    {
      name: "编写轮毂拾取程序",
      type: "b",
      nums: [4],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 4,
    },
    {
      name: "机器人轮毂拾取程序调试运行",
      type: "b",
      nums: [5],
    },
    {
      name: "确认“伺服状态”处于“开启”状态，“倍率”为25%，点击运行",
      type: "c",
      num: 5,
    },
    // scara2
    {
      name: "轮毂放置",
      type: "a",
      nums: [6, 7, 8, 9, 10],
      to: 6,
    },
    {
      name: "规划轮毂放置的运动路径",
      type: "b",
      nums: [6],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 6,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [7, 8],
    },
    {
      name: "用户坐标系选中“全局坐标系：0”，工具坐标系选中“全局坐标系：0”，然后点击“OK”进行确认。",
      type: "c",
      num: 7,
    },
    {
      name: "依次点击“工作原点”、“轮毂点位”进行示教点位信息记录",
      type: "c",
      num: 8,
    },
    {
      name: "编写轮毂放置程序",
      type: "b",
      nums: [9],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 9,
    },
    {
      name: "机器人轮毂放置程序调试运行",
      type: "b",
      nums: [10],
    },
    {
      name: "确认“伺服状态”处于“开启”状态，“倍率”为25%，点击运行",
      type: "c",
      num: 10,
    },
    // scara3
    {
      name: "压装工位上料",
      type: "a",
      nums: [11, 12, 13, 14, 15],
      to: 11,
    },
    {
      name: "规划压装工位上料的运动路径",
      type: "b",
      nums: [11],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 11,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [12, 13],
    },
    {
      name: "用户坐标系选中“全局坐标系：0”，工具坐标系选中“全局坐标系：0”，然后点击“OK”进行确认。",
      type: "c",
      num: 12,
    },
    {
      name: "依次点击“工作原点”、“轮毂点位”进行示教点位信息记录",
      type: "c",
      num: 13,
    },
    {
      name: "编写压装工位上料程序",
      type: "b",
      nums: [14],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 14,
    },
    {
      name: "机器人压装工位上料程序调试运行",
      type: "b",
      nums: [15],
    },
    {
      name: "确认“伺服状态”处于“开启”状态，“倍率”为25%，点击运行",
      type: "c",
      num: 15,
    },
    // scara4
    {
      name: "压装工位下料",
      type: "a",
      nums: [16, 17, 18, 19, 20],
      to: 16,
    },
    {
      name: "规划压装工位下料的运动路径",
      type: "b",
      nums: [16],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 16,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [17, 18],
    },
    {
      name: "用户坐标系选中“全局坐标系：0”，工具坐标系选中“全局坐标系：0”，然后点击“OK”进行确认。",
      type: "c",
      num: 17,
    },
    {
      name: "依次点击“工作原点”、“轮毂点位”进行示教点位信息记录",
      type: "c",
      num: 18,
    },
    {
      name: "编写压装工位下料程序",
      type: "b",
      nums: [19],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 19,
    },
    {
      name: "机器人压装工位下料程序调试运行",
      type: "b",
      nums: [20],
    },
    {
      name: "确认“伺服状态”处于“开启”状态，“倍率”为25%，点击运行",
      type: "c",
      num: 20,
    },
    // scara5
    {
      name: "视觉检测",
      type: "a",
      nums: [21, 22, 23, 24, 25],
      to: 21,
    },
    {
      name: "规划视觉检测的运动路径",
      type: "b",
      nums: [21],
    },
    {
      name: "查看表格中相关信息名称，用来后续程序的调用。",
      type: "c",
      num: 21,
    },
    {
      name: "示教点位",
      type: "b",
      nums: [22, 23],
    },
    {
      name: "用户坐标系选中“全局坐标系：0”，工具坐标系选中“全局坐标系：0”，然后点击“OK”进行确认。",
      type: "c",
      num: 22,
    },
    {
      name: "依次点击“工作原点”、“轮毂点位”进行示教点位信息记录",
      type: "c",
      num: 23,
    },
    {
      name: "编写视觉检测程序",
      type: "b",
      nums: [24],
    },
    {
      name: "在下列程序中，选择合适的指令和点位完成程序的编写",
      type: "c",
      num: 24,
    },
    {
      name: "机器人视觉检测程序调试运行",
      type: "b",
      nums: [25],
    },
    {
      name: "确认“伺服状态”处于“开启”状态，“倍率”为25%，点击运行",
      type: "c",
      num: 25,
    },
    {
      name: "分拣机构下料调试",
      type: "a",
      nums: [26],
      to: 26,
    },
    {
      name: "在触摸屏中进行分拣机构下料调试",
      type: "c",
      num: 26,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [27],
      to: 27,
    },
  ],
  HMI模拟A: [
    // {
    //   name: "切换机器人控制模式",
    //   type: "a",
    //   nums: [1],
    //   to: 1,
    // },
    // {
    //   name: "将模式切换成自动模式，并点击电机灯切换成常亮",
    //   type: "c",
    //   num: 1,
    // },
    {
      name: "工作站的整体运行调试",
      type: "a",
      nums: [2],
      to: 2,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 2,
    },
    {
      name: "启动仓储取放轮毂任务演示",
      type: "a",
      nums: [3],
      to: 3,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 3,
    },
    {
      name: "启动打磨轮毂任务演示",
      type: "a",
      nums: [4],
      to: 4,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 4,
    },
    {
      name: "启动加工车标任务演示",
      type: "a",
      nums: [5],
      to: 5,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 5,
    },
    {
      name: "启动压装车标任务演示",
      type: "a",
      nums: [6],
      to: 6,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 6,
    },
    {
      name: "启动压装轮胎任务演示",
      type: "a",
      nums: [7],
      to: 7,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 7,
    },
    {
      name: "启动检测车轮任务演示",
      type: "a",
      nums: [8],
      to: 8,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 8,
    },
    {
      name: "启动分拣车轮任务演示",
      type: "a",
      nums: [9],
      to: 9,
    },
    {
      name: "在触摸屏中，选择正确的触摸屏操作页面进行操作。",
      type: "c",
      num: 9,
    },
    {
      name: "实训结束",
      type: "a",
      nums: [10],
      to: 10,
    },
  ],
} as any;
